print("-----구구단 출력하기------")
for x in range(2, 10):
    for y in range(1, 10):
        print(f'{x} * {y} = {x * y}')
    print("----------------------")
#=======================================
print("-----짝수단 출력하기------")
for x in range(2, 9, 2):
    for y in range(1,10):
        print(f'{x} * {y} = {x * y}')
    print("----------------------")
#=======================================
print("-----구구단 역순 출력하기------")
for x in range(9, 1, -1):
    for y in range(1,10):
        print(f'{x} * {y} = {x * y}')
    print("----------------------")
#=======================================
for x in range(8, 1, -2):
    for y in range(1,10):
        print(f'{x} * {y} = {x * y}')
    print("----------------------")




